; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph0 - mode
	image1 - mode
	GroundStation4 - direction
	Star5 - direction
	GroundStation11 - direction
	Star2 - direction
	Star8 - direction
	Star6 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation10 - direction
	Star7 - direction
	GroundStation9 - direction
	Star3 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star6)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star7)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star8)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star8)
	(supports instrument5 image1)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation10)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation9)
)
(:goal (and
	(have_image Phenomenon12 image1)
	(have_image Star13 spectrograph0)
	(have_image Star14 spectrograph0)
	(have_image Phenomenon15 image1)
	(have_image Phenomenon16 spectrograph0)
	(have_image Phenomenon17 image1)
	(have_image Planet18 spectrograph0)
	(have_image Planet19 image1)
))

)

; plan
1. (turn_to satellite0 star7 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star7)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 star7)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 phenomenon16 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 8
5. (take_image satellite0 phenomenon16 instrument1 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon15 instrument1 image1)
   added: (have_image phenomenon15 image1)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon17 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon17 instrument1 image1)
   added: (have_image phenomenon17 image1)
   goals met: 4 of 8
12. (turn_to satellite0 planet18 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet18)
   goals met: 4 of 8
13. (take_image satellite0 planet18 instrument1 spectrograph0)
   added: (have_image planet18 spectrograph0)
   goals met: 5 of 8
14. (turn_to satellite0 planet19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet19)
   goals met: 5 of 8
15. (take_image satellite0 planet19 instrument1 image1)
   added: (have_image planet19 image1)
   goals met: 6 of 8
16. (turn_to satellite0 star13 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 star13)
   goals met: 6 of 8
17. (take_image satellite0 star13 instrument1 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 7 of 8
18. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 7 of 8
19. (take_image satellite0 star14 instrument1 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 8 of 8
